w4_hyper_card/emacs_browser_url/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2024-10-16 Wed 15:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs周辺のbrowserの設定</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content">
<h1 class="title">emacs周辺のbrowserの設定</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb0255d0">1. emacs org</a>
<ul>
<li><a href="#org4af4719">1.1. org export to html</a></li>
<li><a href="#org6e04c61">1.2. org open html link</a></li>
</ul>
</li>
<li><a href="#orgdec05f3">2. browser</a></li>
<li><a href="#orgd8cfac8">3. open ./file.html</a></li>
<li><a href="#orgdbd1472">4. colorize</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb0255d0" class="outline-2">
<h2 id="orgb0255d0"><span class="section-number-2">1</span> emacs org</h2>
<div class="outline-text-2" id="text-1">
<p>
emacsではmajor modeというのがあって，それが下のstatus barの真ん中にまる括弧()で
しめされている．
</p>

<p>
今は，たぶんOrg Ind.
</p>

<p>
c-cで始まるコマンドがそこへ渡される．
org-modeの便利なコマンドとして次の二つがある．
これをwslで動作させる設定．
</p>
</div>

<div id="outline-container-org4af4719" class="outline-3">
<h3 id="org4af4719"><span class="section-number-3">1.1</span> org export to html</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>c-c c-e [h]tml [o]pen</li>
</ul>
</div>
</div>
<div id="outline-container-org6e04c61" class="outline-3">
<h3 id="org6e04c61"><span class="section-number-3">1.2</span> org open html link</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>c-c c-o</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgdec05f3" class="outline-2">
<h2 id="orgdec05f3"><span class="section-number-2">2</span> browser</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>No usable browser found エラーが出る場合，</li>
<li><a href="https://qiita.com/tadsan/items/8c66e7d753a1b24acd4e">WSL2のEmacsからWindows側のブラウザを開く</a></li>
<li>で解決．</li>
</ul>
<ul class="org-ul">
<li>ただし，setoptでエラーが出るかも．setqに変更で解決</li>
</ul>
</div>
</div>

<div id="outline-container-orgd8cfac8" class="outline-2">
<h2 id="orgd8cfac8"><span class="section-number-2">3</span> open ./file.html</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-bash">open ./readme.html
Couldn<span style="color: #8b2252;">'t find a suitable web browser!</span>

<span style="color: #8b2252;">Set the BROWSER environment variable to your desired browser.</span>

<span style="color: #8b2252;">Warning: program returned non-zero exit code #256</span>
</pre>
</div>

<p>
open を~/bin/に置く．
さらに，~/.config/fish/config.fishにて
</p>
<div class="org-src-container">
<pre class="src src-fish">alias emacs "emacs -nw"
set -gx BROWSER /home/[USERNAME]/bin/open
set PATH . ~/bin $PATH
</pre>
</div>
<p>
を追記．
</p>
</div>
</div>
<div id="outline-container-orgdbd1472" class="outline-2">
<h2 id="orgdbd1472"><span class="section-number-2">4</span> colorize</h2>
<div class="outline-text-2" id="text-4">
<p>
orgからexport htmlするとcolorizeが失敗．
</p>
<ul class="org-ul">
<li><a href="https://qiita.com/daddygongon/items/298e3e351bf15cfaa699">emacs26.1にしてorg-to-htmlしたらemacs-htmlizeを入れなさいって．</a></li>
</ul>
<p>
のつい追記に従って設定．
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2024-10-16 Wed 15:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
